<?xml version="1.0" ?><policyDefinitionResources revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions"><!--microsoft_edge version: 109.0.1518.49--><displayName/><description/><resources><stringTable><string id="WebView2LoaderOverrideSettings_group">Definições de substituição do carregador</string><string id="BrowserExecutableFolder">Configurar a localização da pasta executável do browser</string><string id="BrowserExecutableFolder_Explain">Esta política configura as aplicações do WebView2, de modo a utilizar o WebView2 Runtime no caminho especificado. A pasta deve conter os seguintes ficheiros: msedgewebview2.exe, msedge.dll, entre outros.

Para definir o valor do caminho da pasta, forneça um nome e um par de Valores. Define o nome do valor como o ID do Modelo de Utilizador da Aplicação ou como o nome do ficheiro executável. Pode utilizar o caráter universal &quot;*&quot; como nome de valor para todas as aplicações.

Valor de exemplo:

Name: *, Value: C:\Program Files\Microsoft Edge WebView2 Runtime Redistributable 85.0.541.0 x64</string><string id="BrowserExecutableFolderDesc">Configurar a localização da pasta executável do browser</string><string id="ReleaseChannelPreference">Definir a preferência de ordem de pesquisa do canal de lançamento</string><string id="ReleaseChannelPreference_Explain">A ordem de pesquisa de canais predefinida é: WebView2 Runtime, Beta, Dev e Canary.

Para reverter a ordem de pesquisa predefinida, defina esta política como 1.

Para definir o valor do caminho de preferência do canal de lançamento, forneça um nome e um par de Valores. Define o nome do valor como o ID do Modelo de Utilizador da Aplicação ou como o nome do ficheiro executável. Pode utilizar o caráter universal &quot;*&quot; como nome de valor para todas as aplicações.

Valor de exemplo:

Name: *, Value: 1</string><string id="ReleaseChannelPreferenceDesc">Definir a preferência de ordem de pesquisa do canal de lançamento</string><string id="ExperimentationAndConfigurationServiceControl">Controlar a comunicação com o Serviço de Experimentação e Configuração</string><string id="ExperimentationAndConfigurationServiceControl_Explain">O Serviço de Experimentação e Configuração é utilizado para implementar payloads de Experimentação e Configuração no client.

O payload de experiência consiste numa lista de funcionalidades de desenvolvimento antecipadas que a Microsoft está a ativar para testes e feedback.

O payload de configuração consiste numa lista de definições recomendadas que a Microsoft pretende implementar para otimizar a experiência de utilizador.

O payload de configuração também pode conter uma lista de ações a efetuar em determinados domínios por motivos de  compatibilidade. Por exemplo, o browser pode substituir a cadeia do Agente de Utilizador num Web site se esse web site estiver partido. Cada uma destas ações destina-se a ser temporária enquanto a Microsoft tenta resolver o problema com o proprietário do site.

Se definir esta política como &quot;FullMode&quot;, o payload completo é transferido do Serviço de Experimentação e  Configuração. Isto inclui a experimentação e a configuração payloads.

Se definir esta política como  &quot;ConfigurationsOnlyMode&quot;, apenas o payload de configuração é transferido.

Se definir esta política como &quot;RestrictedMode&quot;, a comunicação com o Serviço de Experimentação e Configuração é completamente interrompida. A Microsoft não recomenda esta definição.

Se não configurar esta política num dispositivo gerido, o comportamento nos canais Beta e Estável é o mesmo que o &quot;ConfigurationsOnlyMode&quot;. Nos canais Canary e Dev, o comportamento é o mesmo que &quot;FullMode&quot;.

 Se não configurar esta política num dispositivo não tripulado, o comportamento é o mesmo que o  &quot;FullMode&quot;.

Mapeamento de opções de política:

* FullMode (2) = Obter configurações e experimentações

* ConfigurationsOnlyMode (1) = Obter apenas configurações

* RestrictedMode (0) = Desativar a comunicação com o Serviço de Experimentação e Configuração

Utilize as informações mencionadas anteriormente ao configurar esta política.</string><string id="ExperimentationAndConfigurationServiceControl_FullMode">Obter configurações e experimentações</string><string id="ExperimentationAndConfigurationServiceControl_ConfigurationsOnlyMode">Obter apenas configurações</string><string id="ExperimentationAndConfigurationServiceControl_RestrictedMode">Desativar a comunicação com o Serviço de Experimentação e Configuração</string><string id="SUPPORTED_WIN7_V97">Microsoft Edge versão 97, Windows 7 ou posterior</string><string id="SUPPORTED_WIN7_V87">Microsoft Edge versão 87, Windows 7 ou posterior</string><string id="microsoft_edge_webview2">Microsoft Edge WebView2</string><string id="microsoft_edge_webview2_recommended">Microsoft Edge WebView2 - Predefinições (os utilizadores podem substituir)</string></stringTable><presentationTable><presentation id="BrowserExecutableFolder"><listBox refId="BrowserExecutableFolderDesc">Defina o nome do valor para o ID do modelo de utilizador da aplicação ou o nome do ficheiro executável. Pode utilizar o caráter universal &quot;*&quot; como nome de valor a aplicar a todas as aplicações.</listBox></presentation><presentation id="ReleaseChannelPreference"><listBox refId="ReleaseChannelPreferenceDesc">Defina o nome do valor para o ID do modelo de utilizador da aplicação ou o nome do ficheiro executável. Pode utilizar o caráter universal &quot;*&quot; como nome de valor a aplicar a todas as aplicações.</listBox></presentation><presentation id="ExperimentationAndConfigurationServiceControl"><dropdownList refId="ExperimentationAndConfigurationServiceControl">Controlar a comunicação com o Serviço de Experimentação e Configuração</dropdownList></presentation></presentationTable></resources></policyDefinitionResources>